In [21]:
import pandas as pd

data = {
    'age': [25, 30, 35, 40],
    'salary': [50000, 60000, 70000, 80000],
    'gender': ['F', 'M', 'F', 'M']
}

df = pd.DataFrame(data)
df.head(2) # this is very similar to select * from table limit 2
df.tail(2) # this is very similar to select * from table limit -2

   age  salary gender
2   35   70000      F
3   40   80000      M

In [5]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df.shape
df.columns 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     4 non-null      int64
 1   salary  4 non-null      int64
dtypes: int64(2)
memory usage: 196.0 bytes

In [14]:
df.describe(include='all')

              age        salary gender
count    4.000000      4.000000      4
unique        NaN           NaN      2
top           NaN           NaN      F
freq          NaN           NaN      2
mean    32.500000  65000.000000    NaN
std      6.454972  12909.944487    NaN
min     25.000000  50000.000000    NaN
25%     28.750000  57500.000000    NaN
50%     32.500000  65000.000000    NaN
75%     36.250000  72500.000000    NaN
max     40.000000  80000.000000    NaN

In [ ]:
df.head()

# select age from table
type(df['age'])

pandas.core.series.Series

In [26]:
# select age, salary from table
df[['age', 'salary']]

   age  salary
0   25   50000
1   30   60000
2   35   70000
3   40   80000

In [28]:
df

   age  salary gender
0   25   50000      F
1   30   60000      M
2   35   70000      F
3   40   80000      M

In [ ]:
# select age, salary from table where age<35 : filtering
cond_1 =(df.age < 35)
cond_2 = (df.gender=='F')

df[cond_1 & cond_2]

   age  salary gender
0   25   50000      F

In [39]:
report_df = df.groupby('gender').agg({'salary':['mean','sum'],
                          'age':'mean'})

# this is very similar to sql group by
# select avg(salary), sum(salary), avg(age) from table group by gender

# sometime you also do order by
df.groupby('gender').agg({'salary':['mean','sum'],
                          'age':'mean'}).sort_values(by=('salary', 'mean'), ascending=False)

         salary           age
           mean     sum  mean
gender
M       70000.0  140000  35.0
F       60000.0  120000  30.0

In [38]:
type(report_df)

pandas.core.frame.DataFrame

In [43]:
data = {
    'product_id': [1, 2, 3, 4, 5],
    'product_name': ['A', 'B', 'C', 'D', 'E'],
    'category': ['X', 'Y', 'X', 'Y', 'X'],
    'brand': ['P', 'P', 'P', 'Q', 'P'],
    'price': [100, 200, 150, 300, 250],
    'quantity': [10, 20, 15, 30, 25]
}

retail_df = pd.DataFrame(data)

In [44]:
retail_df.head()

   product_id product_name category brand  price  quantity
0           1            A        X     P    100        10
1           2            B        Y     P    200        20
2           3            C        X     P    150        15
3           4            D        Y     Q    300        30
4           5            E        X     P    250        25

In [46]:
final_result =retail_df.groupby(['category', 'brand']).agg({'price':'mean', 'quantity':'sum'})

In [51]:
final_result.to_csv('/Users/rahultiwari/Documents/Harika_AI/data/final_report.csv')

In [52]:
data = pd.read_csv('/Users/rahultiwari/Documents/Harika_AI/data/final_report.csv')

In [53]:
data

  category brand       price  quantity
0        X     P  166.666667        50
1        Y     P  200.000000        20
2        Y     Q  300.000000        30

In [ ]:
# assignment
import numpy as np
# lets create the datafor retail domain with discount and other variable
data= {
    'product_id': np.random.randint(1000, 9999, 5000),
    'product_name': np.random.choice(['A', 'B', 'C', 'D', 'E'], 5000),
    'category': np.random.choice(['Electronics', 'Clothing', 'Groceries'], 5000),
    'brand': np.random.choice(['P', 'Q', 'R'], 5000),
    'price': np.random.uniform(10, 100, 5000),
    'quantity': np.random.randint(1, 20, 5000),
    'discount': np.random.uniform(0, 0.3, 5000)
}

df = pd.DataFrame(data)
df.head()

# Questions

# 1. What is the average price of products in each category?
# 2. Which brand has the highest average discount?
# 3. What is the total revenue generated from each product?
# 4. How many products are there in each category?
# 5. What is the most popular product (highest quantity sold)?

   product_id product_name     category brand      price  quantity  discount
0        3116            A    Groceries     R  71.891985         9  0.150720
1        5401            E    Groceries     R  80.367440         4  0.241225
2        9000            D  Electronics     P  63.289047         8  0.172296
3        4534            B  Electronics     Q  30.401604         1  0.027600
4        2821            C     Clothing     Q  70.106364         2  0.288156

In [ ]:
# https://pandas.pydata.org/docs/getting_started/index.html#getting-started